frontend/modules/main/controllers/DefaultController.php

    public function actionAdd() {

        $user_id = Yii::$app->user->id;
        $coin_id = Yii::$app->request->post('coin_id');
        $count_coin = Yii::$app->request->post('count_coin');

        $model = new CoinsUsers();

        $coin = $model->find()->where(['coin_id' => $coin_id, 'user_id' => $user_id])->asArray()->one();
---
SELECT * FROM `coins_users` WHERE (`coin_id`='1') AND (`user_id`=1)

    public function actionDel($name_coin) {

        $user_id = Yii::$app->user->id;

        $model_coins = new Coins();
        $coin = $model_coins->find()->where(['name' => $name_coin])->one();

        $coin_id = $coin->id;

        $model = new CoinsUsers();
        $_coin = $model->find()->where(['user_id' => $user_id, 'coin_id' => $coin_id])->one();
---
SELECT * FROM `coins` WHERE `name`='bitcoin'
SELECT * FROM `coins_users` WHERE (`user_id`=1) AND (`coin_id`=1)