backend/controllers/NotificationController.php

	public function actionIndex()
	{
		$model = new Notification();
		$active = $model->find()->asArray()->where(['active' => 1])->orderBy('id DESC')->all();
		$noActive = $model
			->find()
			->asArray()
			->where(['active' => 0])
			->limit(3)
			->orderBy('id DESC')
			->all();
---
SELECT * FROM `notification` WHERE `active`=1 ORDER BY `id` DESC
SELECT * FROM `notification` WHERE `active`=0 ORDER BY `id` DESC LIMIT 3