frontend/modules/user/models/User.php

     public static function findIdentity($id)
    {
        $user = self::findOne(['id' => $id]);
---
SELECT * FROM `users` WHERE `id`=1

    public static function findByUsername($username)
    {
        return self::findOne(['username' => $username]);
---
SELECT * FROM `users` WHERE `username`='admin'