frontend/modules/main/models/CoinsUsers.php

SELECT * FROM `coins_users` WHERE `user_id`=1 ORDER BY `id` DESC
SELECT * FROM `coins` WHERE `id` IN ('12', '54', '23', '1098', '9', '92', '97', '60', '111', '3', '1088', '96', '39', '20') ORDER BY `id` DESC
---
    public function getCoinsByUser()
    {
        $user_id = Yii::$app->user->id;
        $coins_user = $this->find()->where(['user_id' => $user_id])->orderBy('id DESC')->asArray()->all();
        $ids = [];
        $quans = [];
        for ($i=0; count($coins_user) > $i; $i++) {
            $ids[$i] = $coins_user[$i]['coin_id'];
        }
        $coins_model = new Coins();
        $coins = $coins_model->find()->where(['id' => $ids])->orderBy('id DESC')->asArray()->all();