frontend/modules/main/models/Coins.php

SELECT * FROM `coins`
---
    public function getDataSearch($query) {
        if ( !empty($query) ) {
            $searchObj  = new SearchClass();
            $indexQuery = ( $searchObj -> make_index($query) );

            $data = self::find()->asArray()->all();