backend/models/ImageManager.php

	public function getImages()
	{
		$query = self::find();
	    $countQuery = clone $query;
	    $pages = new Pagination(['totalCount' => $countQuery->count(), 'pageSize' => 18]);
	    $pages->pageSizeParam = false;
	    $imgs = $query->offset($pages->offset)
	    ->orderBy('id DESC')
        ->limit($pages->limit)
        ->asArray()
        ->all();
---
SELECT COUNT(*) FROM `images`
SELECT * FROM `images` ORDER BY `id` DESC LIMIT 18